soiv-dmp-test/src/main/resources/com/ericsson/soiv/teststeps/protocols/bscs/GetAccountBalance.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:bal="http://ericsson.com/services/ws_CIL_6/balancehistoryread" xmlns:ses="http://ericsson.com/services/ws_CIL_6/sessionchange">
<soapenv:Header>
        <Security xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <UsernameToken>
                <Username>ADMX</Username>
                <Password>ADMX</Password>
            </UsernameToken>
        </Security>
    </soapenv:Header>
    <soapenv:Body>
        <bal:balanceHistoryReadRequest>
            <bal:inputAttributes>
                <bal:coIdPub>{{contractID}}</bal:coIdPub>
            </bal:inputAttributes>
            <bal:sessionChangeRequest>
                <ses:values>
                    <ses:item>
                        <ses:key>BU_ID</ses:key>
                        <ses:value>2</ses:value>
                    </ses:item>
                </ses:values>
            </bal:sessionChangeRequest>
        </bal:balanceHistoryReadRequest>
    </soapenv:Body>
</soapenv:Envelope>